/**********1064***********************************************************
题目描述：
设N是一个四位数，它的9倍恰好是其反序数（例如：1234的反序数是4321）
求N的值
输入：
程序无任何输入数据
输出：
输出题目要求的四位数，如果结果有多组，则每组结果之间以回车隔开
样例输入：
样例输出：
**************************************************************************/

#include <stdio.h>

int main(void){
	int i, j;
	int a1, a2, a3, a4;
	int b1, b2, b3, b4;
	for(i=1000; i<=9999; i++){
		j = i * 9;
		if(j<10000){
			a1 = i % 10;
			b1 = j % 10;
			a2 = (i/10) % 10;
			b2 = (j/10) % 10;
			a3 = (i/100) % 10;
			b3 = (j/100) % 10;
			a4 = (i/1000) % 10;
			b4 = (j/1000) % 10;
			if(a1==b4 && a2==b3 && a3==b2 && a4==b1){
				printf("%d\n", i);
				continue;
			}
		}
		
	}
	return 0;
}

/**************新思路：一种更高效的算法****************
#include <stdio.h>
  
int main()
{  
    int i,m,n;
    for(i = 1000;i < 10000;i++)
    {
        n = i;
        m = 0;
        //求反序数
        while(n)
        {
            m=m*10+n%10;  
            n=n/10;  
        }  
        if(m==i*9)  
        {  
            printf("%d\n",i);  
        }  
    }  
    return 0;  
}  
********************************************************/