/**********1074***********************************************************
题目描述：
打印所有不超过n(n<256)的，其平方具有对称性质的数。
如11*11=121
输入：
无任何输入数据
输出：
输出具有题目要求的性质的数。如果输出数据不止一组，各组数据之间以回车隔开。
样例输入：
样例输出：
**************************************************************************/

#include <stdio.h>

int main(void){
	int i, i2, j, tmp;
	for(i=0; i<256; i++){
		i2 = i * i;
		tmp = i2;
		j = 0;
		while(tmp != 0){
			j = j*10 + tmp%10;
			tmp /= 10;	
		}
		if(j == i2)
			printf("%d\n", i);
	}
	return 0;
}

/**************************************
利用#1064中求反序数的新思想进行变通：
对称即正序数与反序数相等
***************************************/