/********1126******************************************************
题目描述：
在一个整数数组上，对于下标为i的整数，如果它大于所有它相邻的整数，
或者小于所有它相邻的整数，则称为该整数为一个极值点，极值点的下标就是i。
输入：
每个案例的输入如下：
有2×n+1行输入：第一行是要处理的数组的个数n；
对其余2×n行，第一行是此数组的元素个数k(4<k<80)，第二行是k个整数，每两个整数之间用空格分隔。
输出：
每个案例输出为n行：每行对应于相应数组的所有极值点下标值，下标值之间用空格分隔。
样例输入：
3
10
10 12 12 11 11 12 23 24 12 12
15
12 12 122 112 222 211 222 221 76 36 31 234 256 76 76 
15
12 14 122 112 222 222 222 221 76 36 31 234 256 76 73
样例输出：
0 7
2 3 4 5 6 10 12
0 2 3 10 12 14
**************************************************************************/

#include <stdio.h>

int main(void){
	int i, n;
	scanf("%d", &n);
	for(i=0; i<n; i++){
		int data[80]={0};
		int result[80]={0};
		int cnt = 0;
		int j, k;
		scanf("%d", &k);
		for(j=0; j<k; j++)
			scanf("%d", data+j);
		for(j=0; j<k;j++){
			if(j == 0){
				if( data[j] != data[j+1] )
					result[cnt++] = j;
			}
			else if(j > 0 && j < k-1){
				if( (data[j]>data[j-1] && data[j]>data[j+1])
					|| (data[j]<data[j-1] && data[j]<data[j+1]) )
					result[cnt++] = j;
			}
			else{
				if( data[j] != data[j-1] )
					result[cnt++] = j;
			}
		}
		for(j=0; j<cnt-1; j++)
			printf("%d ", result[j]);
		printf("%d\n", result[cnt-1]);
	}
	return 0;
}

/*************************************************************************
else语句块中若以if()判断语句开头，则else不要省略{}，否则由于空格在编译时
忽略，原本要表达的else{ if() }会被当作else if()进行编译，导致程序出错
**************************************************************************/