/*********************************1193************************************
题目描述：
输入一个N*N的矩阵，将其转置后输出。要求：不得使用任何数组(就地逆置)。
输入：
输入的第一行包括一个整数N,(1<=N<=100)，代表矩阵的维数。
接下来的N行每行有N个整数，分别代表矩阵的元素。
输出：
可能有多组测试数据，对于每组数据，将输入的矩阵转置后输出。
样例输入：
3
1 2 3
4 5 6
7 8 9
样例输出：
1 4 7
2 5 8
3 6 9
**************************************************************************/

#include <stdio.h>

int matrix[101][101];

int main(){
	int n;
	int i, j, tmp;
	while(scanf("%d", &n) != EOF){
		for(i=1; i<=n; i++)
			for(j=1; j<=n; j++)
				scanf("%d", &matrix[i][j]);

		for(i=1; i<=n; i++)
			for(j=i+1; j<=n; j++){
				tmp = matrix[i][j];
				matrix[i][j] = matrix[j][i];
				matrix[j][i] = tmp;
			}

		for(i=1; i<=n; i++){
			for(j=1; j<n; j++)
				printf("%d ", matrix[i][j]);
			printf("%d\n", matrix[i][n]);
		}
	}
	return 0;
}