/*********************************1197************************************
题目描述：
输入一个字符串，然后对每个字符进行奇校验，最后输出校验后的二进制数(如'3’，
输出：10110011)。
输入：
输入包括一个字符串，字符串长度不超过100。
输出：
可能有多组测试数据，对于每组数据，
对于字符串中的每一个字符，输出按题目进行奇偶校验后的数，每个字符校验的结果
占一行。
样例输入：
3
3a
样例输出：
10110011
10110011
01100001
**************************************************************************/

#include <stdio.h>
#include <string.h>

int main(){
	char s[101];
	int binary[8];
	int i, j, len, ascii, len2, cnt;
	while(scanf("%s", s) != EOF){
		len = strlen(s);
		for(i=0; i<len; i++){
			len2 = 0;
			cnt = 0;
			ascii = s[i];
			while(ascii != 0){
				binary[len2++] = ascii % 2;
				if(binary[len2-1] == 1)
					cnt++;
				ascii /= 2;
			}
			if(len2 < 7){
				for(j=len2; j<7; j++)
					binary[j] = 0;
			}
			if(cnt % 2 == 0)
				binary[7] = 1;
			else
				binary[7] = 0;
			for(j=7; j>=0; j--)
				printf("%d", binary[j]);
			printf("\n");
		}
	}
	return 0;
}

//注意这题输出采用的是固定长度，依据是‘3’的奇校验码的从左到右第二位为0，
//而实际上‘3’的ascii码的二进制为110011，而示例为0110011