/*********************************1203************************************
题目描述：
    输入一个ip地址串，判断是否合法。
输入：
    输入的第一行包括一个整数n(1<=n<=500)，代表下面会出现的IP地址的个数。
    接下来的n行每行有一个IP地址，IP地址的形式为a.b.c.d，其中a、b、c、d都是整数。
输出：
    可能有多组测试数据，对于每组数据，如果IP地址合法则输出"Yes!”，否则输出"No!”。
样例输入：
2
255.255.255.255
512.12.2.3
样例输出：
Yes!
No!
提示：
合法的IP地址为：
a、b、c、d都是0-255的整数。
**************************************************************************/

#include <stdio.h>
#include <string.h>

char ip[20];
int dot[4];

int main(){
	int n;
	int i, j, len, cnt_dot, l1, l2, l3, l4, c, sum1, sum2, sum3, sum4;
	while(scanf("%d", &n) != EOF){
		for(j=0; j<n; j++){
			scanf("%s", ip);
			len = strlen(ip);

			if(len<7 || len>15){
				printf("No!\n");
				continue;
			}

			cnt_dot = 0;
			for(i=0; i<len; i++){
				if(ip[i] == '.'){
					dot[cnt_dot++] = i;
				}
			}

			if(cnt_dot != 3){
				printf("No!\n");
				continue;
			}

			l1 = dot[0];
			l2 = dot[1]-dot[0]-1;
			l3 = dot[2]-dot[1]-1;
			l4 = len-dot[2]-1;

			if(l1<1 || l1>3 || l2<1 || l2>3 || l3<1 || l3>3 || l4<1 || l4>3){
				printf("No!\n");
				continue;
			}

			if((l1>1&&ip[0]=='0') || (l2>1&&ip[dot[0]+1]=='0') || (l3>1&&ip[dot[1]+1]=='0') || (l4>1&&ip[dot[2]+1]=='0')){
				printf("No!\n");
				continue;
			}

			c = 1;
			sum1 = 0;
			for(i=dot[0]-1; i>=0; i--){
				sum1 = sum1 + (ip[i]-'0')*c;
				c *= 10;
			}

			c = 1;
			sum2 = 0;
			for(i=dot[1]-1; i>=dot[0]+1; i--){
				sum2 = sum2 + (ip[i]-'0')*c;
				c *= 10;
			}

			c = 1;
			sum3 = 0;
			for(i=dot[2]-1; i>=dot[1]+1; i--){
				sum3 = sum3 + (ip[i]-'0')*c;
				c *= 10;
			}

			c = 1;
			sum4 = 0;
			for(i=len-1; i>=dot[2]+1; i--){
				sum4 = sum4 + (ip[i]-'0')*c;
				c *= 10;
			}

			if((sum1>=0&&sum1<=255) && (sum2>=0&&sum2<=255) && (sum3>=0&&sum3<=255) && (sum4>=0&&sum4<=255))
				printf("Yes!\n");
			else
				printf("No!\n");
		}
	}
	return 0;
}

/*********************************************************************
OUTPUT LIMIT EXCEED的问题出在line 31开始使用的是i导致和循环体内的小循
环使用的i重复了，从而引起错误。
在涉及多重循环的代码中，一定要注意循环标记量的使用规范：
1.如果是while等类型的循环，是否有一个明确的循环结束的条件
2.如果是for循环，循环条件内三个域的变量是否一致（除去某些特殊的循环终
止条件或循环计数条件）
3.多重循环存在时，循环计数变量要区分开，不能误用或重复使用
4.for循环中循环初始条件和结束条件要与循环计数变量的变化方向相吻合
**********************************************************************/